//
//  Constants.swift
//  Movies
//
//  Created by Азат Киракосян on 01.01.2021.
//

import Foundation


// MARK: - Constants

extension ViewController {
    
    enum Constants {
        
       static var models = [
            
        Movie(starImage: #imageLiteral(resourceName: "star"), avatarImage: #imageLiteral(resourceName: "мстители"), descreptionMovie: " Американский художественный фильм о супергероях с элементами комедии режиссёра Джосса Уидона, основанный на одноимённых комиксах издательства Marvel Comics. Картина является шестой по счёту в кинематографической вселенной Marvel.Мстители, прозванные впоследствии «Самыми могучими героями Земли», первоначально состояли из Человека-муравья, Осы, Тора, Железного человека и Халка. Однако с самого начала в составе команды стали происходить изменения: Халк вскоре покинул Мстителей, и к ним присоединился Капитан Америка. ", titleMovie: "Мстители", rateMovie: "6.7/10", relisMovie: "30.02.2019", trailerMovie: "https://www.youtube.com/watch?v=bxwt6TvNxas"),
        Movie(starImage: #imageLiteral(resourceName: "star"), avatarImage: #imageLiteral(resourceName: "люди икс"), descreptionMovie: " Они – новое звено в цепи эволюции. Каждый из них был рожден в результате уникальной генетической мутации, наделившей их с детства необыкновенными способностями. В мире, где царят ненависть и предрассудки, они – причуда науки и каприз природы. Этих изгоев ненавидят и боятся те, кто не способен понять и принять их индивидуальность. И все же, несмотря на невежество и агрессивность масс, Люди Икс и тысячи мутантов, разбросанных по всему миру, выживают и бросают вызов своим притеснителям. Под руководством профессора Чарльза Ксавье, одаренные ученики научились контролировать и управлять своими удивительными способностями в интересах человечества.", titleMovie: "Люди Икс 2", rateMovie: "6.3/10", relisMovie: "28.07.2019", trailerMovie: "https://www.youtube.com/watch?v=9iQT52QMUaA"),
        Movie(starImage: #imageLiteral(resourceName: "star"), avatarImage: #imageLiteral(resourceName: "тор"), descreptionMovie: "  художественный фильм режиссёра Кеннета Брана, основанный на одноимённых комиксах издательства Marvel Comics. Созданием картины занималась компания Marvel Studios, а распространением Paramount Pictures. Главный герой фильма — Тор, высокомерный и гордый бог грома, — был лишён своей силы и изгнан из Асгарда — одного из девяти миров. Оказавшись на Земле, он знакомится с молодым астрофизиком Джейн Фостер, к которой у него появляются некие чувства. Кроме того, Тор должен остановить своего брата Локи, который намерен стать новым царём Асгарда. Картина стала частью кинематографической вселенной Marvel, фильмы которой объединяются в общую сюжетную линию. ", titleMovie: "Тор", rateMovie: "6.9/10", relisMovie: "19.06.2019", trailerMovie: "https://www.youtube.com/watch?v=YVTUeXhFbJ8"),
        Movie(starImage: #imageLiteral(resourceName: "star"), avatarImage: #imageLiteral(resourceName: "доктор"), descreptionMovie: "   Супергерой, появляющийся в американских комиксах издательства Marvel Comics. Доктор Стрэндж исполняет обязанности Верховного мага Земли и является главным защитником Земли от магических и мистических угроз.Страшная автокатастрофа поставила крест на карьере успешного нейрохирурга Доктора Стрэнджа. Отчаявшись, он отправляется в путешествие в поисках исцеления и открывает в себе невероятные способности к трансформации пространства и времени. Теперь он — связующее звено между параллельными измерениями, а его миссия — защищать жителей Земли и противодействовать Злу, какое бы обличие оно ни принимало. ", titleMovie: "Доктор Стрэндж", rateMovie: "5.8/10", relisMovie: "14.03.2019", trailerMovie: "https://www.youtube.com/watch?v=6SlCZgygmbs"),
            Movie(starImage: #imageLiteral(resourceName: "star"),
                  avatarImage: #imageLiteral(resourceName: "бэтмен"), descreptionMovie: " Супергеройский боевик с элементами неонуара режиссёра Кристофера Нолана по комиксам DC Comics, вышедший в 2005 году. Является первой частью новой трилогии о Бэтмене, рассказывающей о его юности и становлении супергероем. Бэтмен – тайное альтер-эго миллиардера Брюса Уэйна, успешного промышленника, филантропа и любимца женщин. ... Бэтмен не имеет сверхспособностей, а использует свой интеллект, навыки боевых искусств, шпионажа, познания в науке и технике, а также несгибаемую волю, способность внушать страх и запугивать своих врагов. ", titleMovie: "Бэтмен", rateMovie: "5.4/10", relisMovie: "11.02.2019", trailerMovie: "https://www.youtube.com/watch?v=muCtJsy-d9w")
            
        ]
    }
}
